app/views/posts/_post.html.erb

  <span>by: <%=link_to post.user.username, user_path(post.user)%> - </span>
  <%=my_time(post.created_at)%><br>
---
INSERT INTO "posts" ("title", "body", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "adfa"], ["body", "adf"], ["url", "zasdfa"], ["user_id", 1], ["created_at", "2015-07-16 20:13:07.253649"], ["updated_at", "2015-07-16 20:13:07.253649"]]