app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 9]]
---
  def new
    @post = Post.find_by(id: params[:post_id])

INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "apples apples green apples"], ["user_id", 1], ["post_id", 13], ["created_at", "2015-07-16 18:25:06.411005"], ["updated_at", "2015-07-16 18:25:06.411005"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = session[:user_id]
    @comment.post_id = params[:post_id]
    if @comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @post = Post.find_by(id: params[:post_id])
    @comment = Comment.find_by(id: params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "BIG GREEN APPLES MAN"], ["updated_at", "2015-07-16 18:34:41.191752"], ["id", 8]]
---
  def update
    comment = Comment.find_by(id: params[:id])
    comment.assign_attributes(comment_params)
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]
---
  def destroy
    comment = Comment.find_by(id: params[:id])
    comment.destroy