app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at desc
---
  def index
    # If your db had 1,000,000 - this would take forever - use limit, order
    @posts = Post.all.order("created_at desc")

INSERT INTO "posts" ("title", "body", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "apple"], ["body", "appless"], ["url", "www.apple.com"], ["user_id", 1], ["created_at", "2015-07-16 16:11:39.788132"], ["updated_at", "2015-07-16 16:11:39.788132"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 12]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "APPPLEEEE?"], ["updated_at", "2015-07-16 16:26:38.396969"], ["id", 12]]
---
  def update
    post = Post.find_by(id: params[:id])
    post.assign_attributes(post_params)
    if post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 12]]
---
  def destroy
    post = Post.find_by(id: params[:id])
    post.destroy